---
kind: type
id: T:Autodesk.Revit.DB.DisplacementPathStyle
source: html/b37f1b44-79a1-01ac-e2e4-fe7ca20c8a58.htm
---
# Autodesk.Revit.DB.DisplacementPathStyle

Used to control the graphical representation of a DisplacementPath element.

## Syntax (C#)
```csharp
public enum DisplacementPathStyle
```